#!/bin/bash
echo ==============================================
echo ="ВНИМАНИЕ! Выбрана АВТОМАТИЧЕСКАЯ смена пула!"=
echo ==============================================
for ((;;))
do

if [[ $POOL == 0 ]]
then
	echo ===================================
	echo ="ВНИМАНИЕ! Выбран пул 0 (Moonbeam)"=
	echo ===================================
	$(which kyve) --name "${MONIKER}" --poolId ${POOL} --mnemonic "${MNEMONIC}" -s "${STAKE}" --keyfile /root/arweave.json --network korellia --verbose
	echo ============================================================================
	echo ="Недостаточно средств для попадания в валидаторы, смена пула через 2 минуты"=
	echo ============================================================================
	POOL=1
	sleep 2m
fi
if [[ $POOL == 1 ]]
then
	echo ===============================================
	echo ="ВНИМАНИЕ! Выбран пул 1 (Avalanche // C-Chain)"=
	echo ===============================================
	$(which kyve) --name "${MONIKER}" --poolId ${POOL} --mnemonic "${MNEMONIC}" -s "${STAKE}" --keyfile /root/arweave.json --network korellia --verbose
	echo ============================================================================
	echo ="Недостаточно средств для попадания в валидаторы, смена пула через 2 минуты"=
	echo ============================================================================
	POOL=3
	sleep 2m
fi 
if [[ $POOL == 3 ]] 
then
	echo ==================================
	echo ="ВНИМАНИЕ! Выбран пул 3 (Bitcoin)"=
	echo ==================================
	$(which kyve-bitcoin) --name "${MONIKER}" --poolId ${POOL} --mnemonic "${MNEMONIC}" -s "${STAKE}" --keyfile /root/arweave.json --network korellia --verbose
	echo ============================================================================
	echo ="Недостаточно средств для попадания в валидаторы, смена пула через 2 минуты"=
	echo ============================================================================
	POOL=4
	sleep 2m
fi

if [[ $POOL == 4 ]]
then
	echo ===============================================
	echo ="ВНИМАНИЕ! Выбран пул 4 (Solana)"=
	echo ===============================================
	$(which  kyve-solana-linux) --name "${MONIKER}" --poolId ${POOL} --mnemonic "${MNEMONIC}" -s "${STAKE}" --keyfile /root/arweave.json --network korellia --verbose
	echo ============================================================================
	echo ="Недостаточно средств для попадания в валидаторы, смена пула через 2 минуты"=
	echo ============================================================================
	POOL=5
	sleep 2m
fi 
if [[ $POOL == 5 ]]
then
	echo ===============================================
	echo ="ВНИМАНИЕ! Выбран пул 5 (Zilliqa)"=
	echo ===============================================
	$(which  kyve-Zilliqa-linux) --name "${MONIKER}" --poolId ${POOL} --mnemonic "${MNEMONIC}" -s "${STAKE}" --keyfile /root/arweave.json --network korellia --verbose
	echo ============================================================================
	echo ="Недостаточно средств для попадания в валидаторы, смена пула через 2 минуты"=
	echo ============================================================================
	POOL=0
	sleep 2m
fi 

done
